jdb333333/ER520M/STM32Driver/USER/lcd_st7565r.c

#include <stdint.h>
#include "king.h"
#include "exthead.h"
//#include "exth.h"

#include "stm32f2xx.h"
#include "TypeDef.h"
#include "lcd_st7565r.h"
#include "flashb.h"

//#define  MMD_HALUO  1 //ccr2015-05-08饸饹

#define Y_Height	16				// 字体高度
#define X_Width		8				// 字体最小宽度

uint8_t ActiveLines = SCREENLN;

uint8_t DotBuffer[8][128]; //page addr:8  column addr:128

const uint8_t pagemap[8] = {3, 2, 1, 0, 7, 6, 5, 4,};
extern const uint8_t ASCIITAB_8x16[];
extern const uint8_t RByte[256];

void ST7565R_IO_Init(void);
void ST7565R_WR_CMD(uint8_t cmd);
void ST7565R_WR_DATA(uint8_t dat);
void st7565SetXY(uint8_t pos_x,uint8_t pos_y);
void st7565DrawPixel( uint8_t x, uint8_t y );
void st7565ClearPixel( uint8_t x, uint8_t y );
void st7565Refresh( void );


extern uint8_t NorFlash_WReadBuffer(uint16_t* pBuffer, uint32_t ReadAddr, uint32_t NumHalfwordToRead);

/**************************************************************************/
/*  延时约1ms
***************************************************************************/
void ST7565R_Delay_ms(uint16_t cnt)
{
	uint16_t i;
	while (cnt--)
		for(i=0; i<20000; i++);
}

void ST7565R_NOP(void)
{
	uint8_t cnt=30/*20*/;
	while(cnt--)
		__NOP(); // __NOP()约5~6ns
}
/**************************************************************************/
/* SPI接口初始化	ST7565R :SCLK\SI\CS\A0
***************************************************************************/
void ST7565R_IO_Init(void)
{

	GPIO_InitTypeDef GPIO_InitStructure;
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB | RCC_AHB1Periph_GPIOF | RCC_AHB1Periph_GPIOG, ENABLE);

	//GPIOF: CLK--GPIO_Pin_6, A0--GPIO_Pin_7, SID--GPIO_Pin_8
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_8;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_Init(GPIOF, &GPIO_InitStructure);
	//GPIOG: CS--GPIO_Pin_15
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15;
	GPIO_Init(GPIOG, &GPIO_InitStructure);
	//GPIOB: BL--GPIO_Pin_2
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
	GPIO_Init(GPIOB, &GPIO_InitStructure);

}

/**************************************************************************/
/* 初始化汉显模块
***************************************************************************/
extern void SysDelay_ms(uint16_t delay_ms);
void mInitialLCD(void)
{

	ApplVar.ScreenStat = 0;

	ST7565R_IO_Init();

	ST7565R_WR_CMD(ST7565R_CMD_RESET);
	ST7565R_NOP();//ST7565R_Delay_ms(1);

	ST7565R_WR_CMD(ST7565R_CMD_ADC_NORMAL);
	ST7565R_WR_CMD(ST7565R_CMD_NORMAL_SCAN_DIRECTION);

	ST7565R_WR_CMD(ST7565R_CMD_LCD_BIAS_9);

	ST7565R_WR_CMD(ST7565R_CMD_POWER_CTRL_ALL_ON);
	//ST7565R_WR_CMD(ST7565R_CMD_POWER_CTRL_ALL_ON+1); //??

	ST7565R_WR_CMD(ST7565R_CMD_VOLTAGE_RESISTOR_RATIO_4);

	ST7565R_WR_CMD(ST7565R_CMD_ELECTRONIC_VOLUME_MODE_SET);
	ST7565R_WR_CMD(ST7565R_CMD_ELECTRONIC_VOLUME(0x0C/*0x24*/));

	ST7565R_WR_CMD(ST7565R_CMD_BOOSTER_RATIO_SET);
	ST7565R_WR_CMD(ST7565R_CMD_BOOSTER_RATIO_5X);

	ST7565R_WR_CMD(ST7565R_CMD_DISPLAY_ON);

	mClearScreen();
    mLightLCDOn();
}

/**************************************************************************/
/* GPIO模拟SPI通讯发送位数据
***************************************************************************/

void ST7565R_SendData(uint8_t dat)
{
	uint8_t i;

	ST7565R_CLK_LOW();
	for (i=0; i<8; i++)
	{
		if ((dat<<i) & 0x80) //高低在先
			ST7565R_SID_HIGH();
		else
			ST7565R_SID_LOW();
		ST7565R_NOP();
		ST7565R_CLK_HIGH();
		ST7565R_NOP();
		ST7565R_CLK_LOW();
	}
	//ST7565R_NOP();
	//ST7565R_CLK_HIGH();
}


/**************************************************************************/
/* 写命令
***************************************************************************/
void ST7565R_WR_CMD(uint8_t cmd)
{

	ST7565R_CS_LOW();
	ST7565R_A0_CMD();
	ST7565R_SendData(cmd);
	ST7565R_CS_HIGH();


}

/**************************************************************************/
/* 写数据
***************************************************************************/
void ST7565R_WR_DATA(uint8_t dat)
{

	ST7565R_CS_LOW();
	ST7565R_A0_DATA();
	ST7565R_SendData(dat);
	ST7565R_CS_HIGH();
}

/*************************************************************************
 设置显示对比度
***************************************************************************/
void mSetContrast(uint8_t contrast)
{//设置显示对比度

	    // 0x00-0x3f对比度由浅到深 //
		contrast *= 4;// (ApplVar.AP.Flag[CONTRAST] & 0x0f) * 5;
		ST7565R_WR_CMD(ST7565R_CMD_ELECTRONIC_VOLUME_MODE_SET);
		ST7565R_WR_CMD(ST7565R_CMD_ELECTRONIC_VOLUME(contrast));
}

/**************************************************************************/
/* 打开显示背光
***************************************************************************/
void mLightLCDOn(void)
{
	ST7565R_BL_ON();
	ApplVar.ScreenStat |= LIGHTON;
}

/**************************************************************************/
/* 关闭显示背光
***************************************************************************/
void mLightLCDOff(void)
{
	ST7565R_BL_OFF();
	ApplVar.ScreenStat &= ~LIGHTON;
}

/**************************************************************************/
/* 允许显示光标
***************************************************************************/
void mEnCursor(uint8_t NewState )
{

	if(NewState)
	{//打开光标
        SETBIT(ApplVar.ScreenStat,CURSOREN);
	}
	else
	{
        if (TESTBIT(ApplVar.ScreenStat,CURSOREN |CURSORON)==(CURSOREN |CURSORON))
            mDispCursor();//关闭光标
        RESETBIT(ApplVar.ScreenStat,(CURSOREN | CURSORON));
	}
}

/**************************************************************************/
/* 显示光标
***************************************************************************/
void mDispCursor(void)
{
	uint8_t valh,vall;
	int x,y;

	if(TESTBIT(ApplVar.ScreenStat,CURSOREN))
	{
		SETBIT(ApplVar.ScreenStat,CRITICAL);
		x = ApplVar.sCursor.x;
		y = ApplVar.sCursor.y;

