jdb333333/ER520M/STM32Driver/USER/lcd_st7565r.c
        y *= 2;
        x *= X_Width;

		if (ApplVar.sCursor.x>=SCREENWD)
			x--;//在屏幕的右边界外显示光标

		INVERTBIT(ApplVar.ScreenStat,CURSORON);
		if(TESTBIT(ApplVar.ScreenStat,CURSORON))
		{
			valh = vall = 0xff;
		}
		else /*ccr2013 if (ApplVar.sCursor.x<SCREENWD)*/ //在屏幕界内处显示光标
		{
			valh = DotBuffer[y][x];
			vall = DotBuffer[y+1][x];
		}
/*ccr2013		else //在屏幕的右边界外显示光标
		{
			valh = 0;
			vall = 0;
		}
*/

		st7565SetXY(x, pagemap[y]);
        if(x==0)
            ST7565R_WR_DATA(valh);	//???? 去掉后会导致发送的第1列8bit点阵没有显示,	发送的内容可为任意字节
		ST7565R_WR_DATA(valh);

		st7565SetXY(x, pagemap[y+1]);
        if(x==0)
            ST7565R_WR_DATA(vall);	//???? 去掉后会导致发送的第1列8bit点阵没有显示,	发送的内容可为任意字节
		ST7565R_WR_DATA(vall);
		RESETBIT(ApplVar.ScreenStat,CRITICAL);
	}
}

/**************************************************************************/
/* 移动光标	在第y(0~3)行,第x(0~15)列位置显示光标，光标靠右对齐
***************************************************************************/
void mMoveCursor(uint8_t x, uint8_t y)
{
	uint8_t i;
    uint8_t cur=TESTBIT(ApplVar.ScreenStat,CURSOREN);

    if (cur)
        mEnCursor(DISABLE);//关闭光标

	for(i = 0; i < x; )
	{
		if(ApplVar.ScreenMap[y][i]<0xA1)  //汉字或ASCII
			i++;
		else
			i += 2;
	}
	ApplVar.sCursor.x = i;
	ApplVar.sCursor.y = y;
    if (cur)
        mEnCursor(ENABLE);
}
/**************************************************************************/
/* 清除反显属性
***************************************************************************/
//void mClearInvAttr(void)
//{
//	RESETBIT(ApplVar.ScreenStat,INVATTR);
//}

/**************************************************************************/
/* 设置反显属性,此后的所有显示将以反显显示
***************************************************************************/
//void mSetInvAttr(void)
//{
//	SETBIT(ApplVar.ScreenStat,INVATTR);
//}

/**************************************************************************/
/* 打开或关闭状态行
***************************************************************************/
void mSetState(uint8_t NewState)
{
	if(NewState)
	{
		SETBIT(ApplVar.ScreenStat,STATEON);
		ActiveLines = (SCREENLN-STATELN);
	}
	else
	{
		RESETBIT(ApplVar.ScreenStat,STATEON);
		ActiveLines = SCREENLN;
	}
}
/**************************************************************************/
/* 清除屏幕内容
***************************************************************************/
void mClearScreen(void)
{
	uint8_t p, pn;
	uint16_t c;

    SETBIT(ApplVar.ScreenStat,CRITICAL);

	if (TESTBIT(ApplVar.ScreenStat,STATEON))
	{//状态行打开时，只清除内容显示行，不清除状态行
		pn = 6;
		memset(ApplVar.ScreenMap,' ',(SCREENLN-1)*SCREENWD);
	}
	else
	{
		pn = 8;
		memset(ApplVar.ScreenMap,' ',sizeof(ApplVar.ScreenMap));
	}

	for(p=0; p<pn; p++)
	{
		st7565SetXY(0, pagemap[p]);
		for(c = 0; c < 129; c++)
		{
			ST7565R_WR_DATA(0x0);
		}
	}
	memset(DotBuffer,0,pn*128);//清除buffer点阵
	GotoXY(0,0);
    RESETBIT(ApplVar.ScreenStat,CRITICAL);

}

/**************************************************************************/
/* 设置显示位置 x=(0..127), y=(0..63)
***************************************************************************/
void st7565SetXY(uint8_t pos_x,uint8_t pos_y)
{
    if (pos_x) pos_x++;//ccr2016-05-11解决第2个字符向左便宜问题????????
	ST7565R_WR_CMD(ST7565R_CMD_PAGE_ADDRESS_SET(pos_y));				// 页地址
	ST7565R_WR_CMD(ST7565R_CMD_COLUMN_ADDRESS_SET_MSB(pos_x >> 4));  	// 列地址高4位
	ST7565R_WR_CMD(ST7565R_CMD_COLUMN_ADDRESS_SET_LSB(pos_x & 0x0f));	// 列地址低4位
}

/**************************************************************************/
/* 把DotBuffer中指定行LinNum(0~3),列ColNum位置的字符点阵重新显示在屏幕上,
适用：仅更新指定位置一个字符时使用
hzFlag:=0,显示ascii字符;=1,显示汉字字符
***************************************************************************/
void mDrawChar(uint8_t ColNum, uint8_t LinNum,uint8_t hzFlag)
{
	uint8_t j;
	uint8_t *pDot;

	ColNum = ColNum*X_Width;
	LinNum *= 2;
#if defined(CASE_FORHANZI)
	if(hzFlag)	 // 汉字模式显示为16位宽度
		hzFlag = 16;
	else
#endif
		hzFlag = 8;

	//显示上半部分
	pDot = &DotBuffer[LinNum][ColNum];
    SETBIT(ApplVar.ScreenStat,CRITICAL);

	st7565SetXY(ColNum, pagemap[LinNum]);
	if(ColNum==0)
		ST7565R_WR_DATA(0xff);	//???? 去掉后会导致发送的第1列8bit点阵没有显示,	发送的内容可为任意字节

	for(j = 0; j < hzFlag; j++)
		ST7565R_WR_DATA(*pDot++);

	//显示下半部分
	LinNum++;
	pDot = &DotBuffer[LinNum][ColNum];
	st7565SetXY(ColNum, pagemap[LinNum]);
	if(ColNum==0)
		ST7565R_WR_DATA(0xff);	//???? 去掉后会导致发送的第1列8bit点阵没有显示,	发送的内容可为任意字节
	for(j = 0; j < hzFlag; j++)
		ST7565R_WR_DATA(*pDot++);

    RESETBIT(ApplVar.ScreenStat,CRITICAL);

}

/**************************************************************************/
/* 把DotBuffer中指定行LinNum(0~3)的字符点阵重新显示在屏幕上,
   即把屏幕上的第LinNum行重新显示一遍,适用：需要更新指定行多个字符时使用
***************************************************************************/
void mDraw1Line(uint8_t LinNum)
{
	uint8_t i, j;

    SETBIT(ApplVar.ScreenStat,CRITICAL);

	for(i = 0; i < 2; i++)
	{
		st7565SetXY(0, pagemap[LinNum*2+i]);
		ST7565R_WR_DATA(0xff);	//???? 去掉后会导致发送的第1列8bit点阵没有显示,	发送的内容可为任意字节
		for(j = 0; j < 128; j++)
		{
			ST7565R_WR_DATA(DotBuffer[LinNum*2+i][j]);
		}
	}
    RESETBIT(ApplVar.ScreenStat,CRITICAL);

}

/**************************************************************************/
/* 发送点阵数据
***************************************************************************/
void st7565Refresh(void)
{
	uint8_t c, p;

    SETBIT(ApplVar.ScreenStat,CRITICAL);
	for(p = 0; p < 8; p++)
	{
		st7565SetXY(0, pagemap[p]);
		ST7565R_WR_DATA(0xff);	//???? 去掉后会导致发送的第1列8bit点阵没有显示,	发送的内容可为任意字节
		for(c = 0; c < 128; c++)
		{
			ST7565R_WR_DATA(DotBuffer[p][c]);
		}
	}
    RESETBIT(ApplVar.ScreenStat,CRITICAL);
}

/**************************************************************************/
/* 画点 x=(0..127), y=(0..63)
***************************************************************************/
void st7565DrawPixel(uint8_t x, uint8_t y)
{
	if ((x >= 128) || (y >= 64))
		return;

	DotBuffer[y/8][x] |= (1 << (7-(y%8)));
}

/**************************************************************************/
/* 清点 x=(0..127), y=(0..63)
***************************************************************************/
void st7565ClearPixel(uint8_t x, uint8_t y)
{
	if ((x >= 128) || (y >= 64))
		return;

	DotBuffer[y/8][x] &= ~(1 << (7-(y%8)));
}

/**************************************************************************/
/* 指定位置显示一个字符
   在LCD屏幕第y(0~3)行,第x(0~15)列位置显示字符ch的点阵
   ch可以是ASCII或者汉字
***************************************************************************/
void mDispCharXY(WORD ch, BYTE x, BYTE y)
{
	uint8_t col, ch_l, x_c, y_p,hzFlag;
	uint32_t addr;
	uint8_t *fontH,*fontL;

	if(y==SCREENLN)
	{
		if (TESTBIT(ApplVar.ScreenStat,STATEON))
			y--;
		else
			return;
	}

