jdb333333/ER520M/STM32Driver/USER/lcd_st7565r.c
	x_c = x*X_Width;	// column address
	y_p = y*2;		 	// page


#if defined(CASE_FORHANZI)
	if ((ch <= 0x7E))
#else
    ch &= 0xff;    //ccr2016-08-31
#endif
	{/* ASCII点阵 */
		hzFlag = 0;
        if (ch < 0x20) ch =0x20;
		addr = (ch - 0x20) * 16;

		fontH = &DotBuffer[y_p][x_c];
		fontL = &DotBuffer[y_p+1][x_c];

		memcpy(fontH,ASCIITAB_8x16+addr,8); 	 // 上半部分
		memcpy(fontL,ASCIITAB_8x16+addr+8,8); 	 // 下半部分

		if(TESTBIT(ApplVar.ScreenStat,INVATTR))
		{
			for (col = 0; col < 8; col++)
			{
				*fontH++ ^= 0xff; 	 // 上半部分
				*fontL++ ^= 0xff;	 //下半部分
			}
			fontH -= 8;
		}
		if((y>=(SCREENLN-1)) && (TESTBIT(ApplVar.ScreenStat,STATEON)))		   // 状态行显示分隔线
		{
			for (col = 0; col < 8; col++)
			{
				*fontH++ |= 0x80; 	// 上半部分
			}
		}

	}
#if defined(CASE_FORHANZI)
	else
	{/* 汉字处理 CCLIB16  */
		hzFlag = 1;
#if MMD_HALUO  //饸饹
        if (ch==0x9af0)//饸
            ch = 0xfad7;
        else if (ch==0x9bf0)//饹
            ch = 0xfbd7;
#endif
		ch -= 0xA1A1;
		ch_l = ch & 0xff;
		if (ch_l >= 15)
			ch_l -= 1;

		//字库芯片是按字进行编址,因此必须32/2,64为ASCII个数(两个ASCII=一个汉字):128/2
		addr = (uint32_t)(ch_l*94 + (ch>>8)+64)*32 + FLASH_HZK16_ADDR;		// 字偏移地址(基地址+偏移地址,16bit)

		fontH = &DotBuffer[y_p][x_c];
		fontL = &DotBuffer[y_p+1][x_c];


		//汉字左半部分
		wFlashReadBuffer((WORD*)fontH, addr, 4); 	//左上部分, 读取8个字节
		wFlashReadBuffer((WORD*)fontL, addr+8, 4); 	//左下部分, 读取8个字节
		fontH+=8;fontL+=8;addr+=16;
		//汉字右半部分
		wFlashReadBuffer((WORD*)fontH, addr, 4); 	//右上部分, 读取8个字节
		wFlashReadBuffer((WORD*)fontL, addr+8, 4); 	//右下部分, 读取8个字节


		fontH -= 8;fontL -= 8;
		if(TESTBIT(ApplVar.ScreenStat,INVATTR))
		{
			for (col = 0; col < 16; col++)
			{
				*fontH++ ^= 0xff; 	 // 上半部分
				*fontL++ ^= 0xff;	 //下半部分
			}
			fontH -= 16;
		}
		if((y>=(SCREENLN-1)) && (TESTBIT(ApplVar.ScreenStat,STATEON)))		   // 状态行显示分隔线
		{
			for (col = 0; col < 16; col++)
			{
				*fontH++ |= 0x80; 	// 上半部分
			}
		}
	}
#endif

	mDrawChar(x, y,hzFlag);
}

/**************************************************************************/
/* 指定位置显示字符串
***************************************************************************/
void mDispStringXY(BYTE* str, BYTE x, BYTE y)
{
	uint8_t i;
	uint8_t *pstr;

	pstr = str;

	for (i = 0; i < SCREENWD && *pstr; )
	{
#if defined(CASE_FORHANZI)
		if(*pstr>=0xA1)
		{//HZK
			mDispCharXY(CWORD(pstr[0]), (x + i) , y);
			pstr+=2;
			i += 2;
		}
		else
#endif			
		{//ASCII
			mDispCharXY(*pstr, (x + i) , y);
			pstr++;
			i++;
		}
	}
}

/**************************************************************************
将ApplVar.ScreenMap中的指定行重新显示在屏幕上
***************************************************************************/
void  mRefreshLine(BYTE y)
{
	if(y < (SCREENLN - (ApplVar.ScreenStat & STATEON)))
		mDispStringXY((uint8_t *)ApplVar.ScreenMap[y], 0, y);
	else if	((ApplVar.ScreenStat & STATEON) && (y==SCREENLN))
	{
		mDispStringXY((uint8_t *)ApplVar.ScreenMap[SCREENLN], 0, SCREENLN);
	}
}


void Test_LCD12864(void)
{
#if !defined(CASE_ASCIIDISPLAY)
    DispStrXY("优创收款机128x64",0,0);
#endif
}


/**
 * 在屏幕指定的ASCII字符位置右上角闪烁显示GPRS标示
 *
 * @author EutronSoftware (2015-02-11)
 *
 * @param ColNum:
 * @param LinNum:
 * @param force:强制显示
 */
void mDrawGPRS(uint8_t ColNum, uint8_t LinNum,uint8_t force)
{
	uint8_t j;
	uint8_t *pDot;
    static uint8_t gFlash=0x40;

    if ((force || (GetSystemTimer() & 0x100) == 0) && !TESTBIT(ApplVar.ScreenStat,CRITICAL))
    {
		if (!(gFlash & 1))
		{
			ColNum = ColNum*X_Width;
			LinNum *= 2;

			//显示上半部分
			pDot = &DotBuffer[LinNum][ColNum]+5;

			st7565SetXY(ColNum+5, pagemap[LinNum]);
			for(j = 0; j < 8-5; j++)
			{
				gFlash ^= 0xc0;
				ST7565R_WR_DATA((*pDot | gFlash));
				pDot++;
			}
			if (!force)
				gFlash |= 1;
		}
    }
	else
		gFlash &=0xc0;

}

//#if !defined(CASE_ASCIIDISPLAY)
/**
 * 在屏幕指定的ASCII字符位置显示电池容量
 *
 * @author EutronSoftware (2014-12-31)
 *
 * @param ctrl :0-不显示;=1测试并显示;=2显示
 * @param ColNum
 * @param LinNum
 */
extern void DisplayDecXY(WORD pDec,int x,int y,int pWdith);
#define VIN_FULL  VIN_8V7 //8.7V---3075mV---0xEE8   +修正值0x6B
#define VIN_NONE  VIN_7V0 //7.0V---1375mV---0x6AA
void mDrawPower(BYTE ctrl, uint8_t ColNum,uint8_t LinNum)
{
#if (0)//ccr2015-03-24 testonly
    static WORD gPower=0;

    uint8_t sByte;
	WORD pDot,j;

    //if (BatteryExist())//&& !DC_DET_GET())//只有在电池供电时,才显示电池容量
    {
        if (ctrl==0)
        {
            gPower = 0;
            return;
        }
        else if (ctrl==1)
        {
            if (gPower==0)
                return;
        }
        gPower = Vin_Vrtc_Val[0];
        //DisplayDecXY(gPower,ColNum+1,4,6);//testonly

        if (gPower>=VIN_FULL)
            j=16;
        else if (gPower<=VIN_NONE)
            j = 0;
        else
            j = ((gPower-VIN_NONE)*16)/(VIN_FULL-VIN_NONE);

        pDot = (1<<j)-1;

        ColNum = ColNum*X_Width;
        LinNum *= 2;

        //显示上半部分

        sByte = (pDot>>8) | 0x80;
        st7565SetXY(ColNum, pagemap[LinNum]);
        ST7565R_WR_DATA(0xff);
        ST7565R_WR_DATA(sByte | 0x40);
        for(j = 0; j < 4; j++)
            ST7565R_WR_DATA(sByte);
        ST7565R_WR_DATA(sByte | 0x40);
        ST7565R_WR_DATA(0xff);

        sByte = (pDot & 0xff);
        st7565SetXY(ColNum, pagemap[LinNum+1]);
        ST7565R_WR_DATA(0xff);
        for(j = 0; j < 6; j++)
            ST7565R_WR_DATA(sByte);
        ST7565R_WR_DATA(0xff);
    }
#endif
}

/**
 * 在字符行LinrFrom和LineTo之间画一个方框
 *
 * @author EutronSoftware (2016-02-24)
 *
 * @param LinFrom:
 * @param LinTo:=LinFrom时,恢复被覆盖的行
 */
void mDrawABox(BYTE LinFrom,BYTE LinTo)
{
    static BYTE LinNum;
    static BYTE maxLine;

    BYTE j;
    BYTE lin1LR,lin1C,lin1XOR;
    BYTE lin2LR,lin2C,lin2XOR;

    SETBIT(ApplVar.ScreenStat,CRITICAL);
    if (LinFrom==LinTo)
    {//回复被覆盖的行
        for (j=LinNum;j<=maxLine;j++)
            mRefreshLine(j);
        LinNum=1;maxLine=0;
    }
    else
    {
        maxLine=LinTo;
        if (maxLine>(SCREENLN-TESTBIT(ApplVar.ScreenStat,STATEON)-1))
            maxLine=(SCREENLN-TESTBIT(ApplVar.ScreenStat,STATEON)-1);

        for (LinNum=LinFrom;LinNum<=maxLine;LinNum++)
        {
            if (LinNum==LinFrom)
            {//画顶行线
                lin1LR=0x0f,lin1C=0x08+0x02;lin1XOR=0x07;
                lin2LR=0xff,lin2C=0x00+0xaa;lin2XOR=0xff;

