jdb333333/ER520M/STM32Driver/USER/lcd_st7565r.c
            }
            else if (LinNum==LinTo)
            {//画底行线
                lin1LR=0xff,lin1C=0x00+0xaa;lin1XOR=0xff;
                lin2LR=0xf0,lin2C=0x10+0xa0;lin2XOR=0xe0;

            }
            else
            {//画中间线
                lin1LR=0xff,lin1C=0x00+0xaa;lin1XOR=0xff;
                lin2LR=0xff,lin2C=0x00+0xaa;lin2XOR=0xff;

            }
            st7565SetXY(0, pagemap[LinNum*2]);
            ST7565R_WR_DATA(0xff);  //???? 去掉后会导致发送的第1列8bit点阵没有显示, 发送的内容可为任意字节

            ST7565R_WR_DATA(lin1LR);
            for(j = 1; j < SCREENWD*8-1; j++)
            {
                if (lin1XOR==lin2LR && j>6 && j<(SCREENWD*8-7))
                    ST7565R_WR_DATA(0x00);
                else
                {
                    ST7565R_WR_DATA(lin1C);
                    lin1C ^= lin1XOR;
                }
            }
            ST7565R_WR_DATA(lin1LR);

            ST7565R_WR_DATA(0);ST7565R_WR_DATA(0);

            st7565SetXY(0, pagemap[LinNum*2+1]);
            ST7565R_WR_DATA(0xff);  //???? 去掉后会导致发送的第1列8bit点阵没有显示, 发送的内容可为任意字节

            ST7565R_WR_DATA(lin2LR);
            for(j = 1; j < SCREENWD*8-1; j++)
            {
                if (lin1XOR==lin2LR && j>6 && j<(SCREENWD*8-7))
                    ST7565R_WR_DATA(0x00);
                else
                {
                    ST7565R_WR_DATA(lin2C);
                    lin2C ^= lin2XOR;
                }
            }
            ST7565R_WR_DATA(lin2LR);

            ST7565R_WR_DATA(0);ST7565R_WR_DATA(0);
        }
        LinNum=LinFrom;
    }
    RESETBIT(ApplVar.ScreenStat,CRITICAL);
}

//#endif


/**************************************************************************/
/* 显示一幅图片
***************************************************************************/
const uint8_t EUTRON_LOGO_128064[8][128]= {
{0x00,0x00,0x00,0x01,0x03,0x07,0x0F,0x1F,0x1F,0x3F,0x3E,0x7D,0x7B,0x77,0x6F,0x5F,0x3F,0x7E,0x7D,0x7B,0x77,0x6F,0x1F,0x3F,0x3F,0x1E,0x0D,0x03,0x03,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
{0x00,0x1F,0x7E,0xFD,0xFB,0xF7,0xEF,0xDF,0xBF,0x7E,0xFD,0xFB,0xF7,0xEF,0xDF,0xBF,0x7F,0xFE,0xFD,0xFB,0xF7,0xEF,0xDF,0xBF,0x7E,0xFD,0xFB,0xF7,0xEF,0xDF,0x3F,0x1F,0x00,0x00,0x00,0x30,0x30,0x3F,0x3F,0x3F,0x3F,0x30,0x30,0x37,0x38,0x3C,0x3E,0x00,0x00,0x00,0x30,0x3F,0x3F,0x3F,0x3F,0x30,0x30,0x00,0x00,0x30,0x30,0x3F,0x3F,0x30,
0x00,0x00,0x3E,0x38,0x30,0x30,0x3F,0x3F,0x3F,0x3F,0x30,0x30,0x38,0x38,0x3E,0x00,0x30,0x30,0x3F,0x3F,0x3F,0x3F,0x30,0x30,0x38,0x3F,0x1F,0x0F,0x07,0x00,0x00,0x00,0x01,0x07,0x0F,0x1F,0x1F,0x38,0x30,0x30,0x30,0x30,0x1C,0x1F,0x0F,0x07,0x03,0x00,0x00,0x30,0x30,0x3F,0x3E,0x3F,0x1F,0x0F,0x03,0x01,0x00,0x30,0x3F,0x3F,0x30,0x00},
{0x00,0x7C,0xFD,0xFB,0xF7,0xEF,0xDF,0xBF,0x7F,0xFE,0xFD,0xFB,0xF7,0xEF,0xDF,0xBF,0x7E,0xFD,0xFB,0xF7,0xEF,0xDF,0xBF,0x7F,0xFE,0xFD,0xFB,0xF7,0xEF,0xDF,0xBF,0x7E,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0xFF,0x61,0xF1,0xFD,0x01,0x03,0x07,0x0F,0x00,0x00,0x00,0xFC,0xFF,0xFF,0xFF,0x07,0x01,0x01,0x01,0x03,0x07,0xFE,0xF8,0x00,
0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0xFF,0x60,0x78,0x7C,0xFF,0xFF,0xCF,0x87,0x01,0x00,0x00,0xF0,0xFC,0xFE,0xFF,0xFF,0x03,0x01,0x00,0x00,0x01,0x07,0xFF,0xFF,0xFE,0xF8,0x00,0x00,0x00,0x01,0xFF,0x01,0x00,0xC0,0xE0,0xF0,0xF8,0xFC,0x7E,0xFF,0xFF,0x00,0x00},
{0x00,0x00,0x80,0xC0,0xE0,0xE0,0xD8,0xBC,0x7E,0xFC,0xFB,0xF7,0xEF,0xDF,0xBF,0x7F,0xFE,0xFD,0xFB,0xF7,0xEF,0xDF,0xBF,0x7F,0xFE,0xFC,0xF8,0xF0,0xE0,0xC0,0x00,0x00,0x00,0x00,0x00,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x00,0x00,0x00,0x00,0x00,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x00,0x00,0x00,0x00,
0x00,0x00,0x00,0x00,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x00,0x00,0x00,0x00,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x00,0x00,0x80,0x80,0x80,0x80,0x80,0x00,0x00,0x00,0x00,0x00,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x00,0x00,0x00,0x00,0x00,0x80,0x80,0x80,0x80,0x80,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x80,0x00,0x00},
{0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x80,0x80,0x80,0x80,0x00,0x80,0x80,0x80,0x80,0x80,0x80,0x00,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x00,0x00,0x00,0x00,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x01,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01,0x01,0x01,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01,0x01,0x01,0x01,0x01,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01,0x01,0x01,0x01,0x01,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
{0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0xFF,0xC7,0xC7,0xC7,0xC7,0xC7,0xC7,0xC7,0xC7,0xC7,0xC0,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0xFF,0xC3,0xC3,0xC3,0xC3,0xC3,0xC3,0xE7,0xFF,0xFF,0xFE,0x7C,0x00,0x00,0x00,0x00,0x01,0x01,0x01,0x01,
0x01,0x01,0x01,0x00,0x00,0x00,0x18,0x38,0x38,0x78,0xFF,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00,0x0F,0x7F,0xFF,0xFF,0xF0,0xC0,0xC0,0xC0,0xE0,0xFF,0xFF,0x7F,0x0F,0x00,0x00,0x00,0x0F,0x7F,0xFF,0xFF,0xF0,0xC0,0xC0,0xC0,0xE0,0xFF,0xFF,0x7F,0x0F,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
{0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0xFF,0x87,0x87,0x87,0x87,0x87,0x87,0x87,0x87,0x87,0x07,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0xFF,0xC0,0xC0,0xC0,0xC0,0xC0,0xC0,0xFE,0xFF,0xFF,0x7F,0x01,0x00,0x00,0x00,0x00,0xE0,0xE0,0xE0,0xE0,
0xE0,0xE0,0xE0,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00,0xF0,0xFE,0xFF,0xFF,0x0F,0x03,0x03,0x03,0x0F,0xFF,0xFF,0xFE,0xF0,0x00,0x00,0x00,0xF0,0xFE,0xFF,0xFF,0x0F,0x03,0x03,0x03,0x0F,0xFF,0xFF,0xFE,0xF0,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
{0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x00,0x00,0x00,0x00,0x80,0x80,0x80,0x80,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x80,0x80,0x80,0x80,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x80,0x80,0x80,0x80,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x80,0x80,0x80,0x80,0x80,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x80,0x80,0x80,0x80,0x80,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00}
};

void mDispLogo(void)
{
	uint8_t p, pn;
	uint16_t c;

	pn = 8;

	for(p=0; p<pn; p++)
	{
		st7565SetXY(0, pagemap[p]);
		for(c = 0; c < 129; c++)
		{
			ST7565R_WR_DATA(EUTRON_LOGO_128064[p][c]);
		}
	}
}



